def replace_all(text, dct):
    trancl_dct = str.maketrans(dct)
    text = text.translate(trancl_dct)
    return text


text = input()
c_dict = {'а': 'Ф', 'б': 'И', 'в': 'Й', 'г': 'P', 'д': 'С', 'е': 'г', 'ё': 'ф', 'ж': 'J', 'з': 'ю', 'и': '[', 'й': 'Е',
          'к': 'E', 'л': 'к', 'м': '3', 'н': 'Y', 'о': ';', 'п': '>', 'р': 'ъ', 'с': 'З', 'т': 'В', 'у': '0', 'ф': 'Ы',
          'х': 'Ц', 'ц': 'М', 'ч': '(', 'ш': 'щ', 'щ': 'Ю', 'ъ': '&', 'ы': 'L', 'ь': '@', 'э': '/', 'ю': 'd',
          'я': '7', '1': '-', '2': 'Ё', '3': 'V', '4': 'Ч', '5': 's', '6': ' ', '7': 'э', '8': '2', '9': '+', '0': 'z',
          '?': '|', '!': '¡', '.': '%',  ',': '*',  '+': '^',  '-': '¿', ' ': 'C'}
text = replace_all(text, c_dict)
print(text)